#pragma once

//! \brief Класс кольцевого буфера.
class RingBuffer
{
private:
	//! \brief Массив кольцевого буфера.
	int* _array;

	//! \brief Индекс конца кольцевого буфера.
	int _tailIndex = -1;

	//! \brief Индекс начала кольцевого буфера.
	int _headIndex = -1;

	//! \brief Вместимость кольцевого буфера.
	int _capacity;

	//! \brief Размер кольцевого буфера.
	int _size = 0;

	//! \brief Фактор роста вместимости массива
	int _growthFactor = 2;

public:
	//! \brief Создаёт класс кольцевой буфер.
	RingBuffer(int capacity);

	//! \brief Освобождает память.
	~RingBuffer();

	//! \brief Добавляет данные в кольцевой буфер.
	//! \param data Данные.
	void AddElement(int data);
	
	//! \brief Достаёт первый элемент из кольцевого буфера,
	//! после чего удаляет этот элемент из буфера.
	//! \return Значение первого элемента.
	int GetElement();

	//! \brief Увеличивает размер массива кольцевого буфера.
	void Resize();

	//! \brief Очищает размер массива кольцевого буфера.
	void ClearRingBuf();

	//! \brief Возвращаетмассив кольцевого буфера,
	//! где первый элемент находится под индексом _headIndex,
	//! а последний под индексом _tailIndex.
	//! \return Массив кольцевого буфера.
	int* GetArray();

	//! \brief Возвращает значение свободного места в кольцевом буфере.
	//! \return Количество свободного места в кольцевом буфере.
	int GetFreeSpace();

	//! \brief Возвращает количество элементов в кольцевом буфере.
	//! \return Количество элементов в кольцевом буфере.
	int GetSize();
};